import { ref } from 'vue'
import { defineStore } from 'pinia'

export const useExerciseStore = defineStore('dbExercise', () => {
  const data_hour = ref([
    {
      type: 'ออกกำลังกาย',
      name: 'กรรเชียงเรือด้วยความเร็ว 17.6 กม./ชม.',
      calory: 970,
      unit: 'กิโลแคลอรี่'
    },
    {
      type: 'ออกกำลังกาย',
      name: 'กรรเชียงเรือด้วยความเร็ว 5.6 กม./ชม.',
      calory: 660,
      unit: 'กิโลแคลอรี่'
    },
    {
      type: 'ออกกำลังกาย',
      name: 'กระโดดเชือก',
      calory: 780,
      unit: 'กิโลแคลอรี่'
    },
    {
      type: 'กิจวัตร',
      name: 'กวาดพื้น',
      calory: 225,
      unit: 'กิโลแคลอรี่'
    },
    {
      type: 'ออกกำลังกาย',
      name: 'การเต้น Zumba',
      calory: 500,
      unit: 'กิโลแคลอรี่'
    },
    {
      type: 'ออกกำลังกาย',
      name: 'ขี่จักรยาน',
      calory: 450,
      unit: 'กิโลแคลอรี่'
    },
    {
      type: 'กิจวัตร',
      name: 'ซักผ้าด้วยมือ',
      calory: 240,
      unit: 'กิโลแคลอรี่'
    },
    {
      type: 'กิจวัตร',
      name: 'ตัดหญ้า',
      calory: 300,
      unit: 'กิโลแคลอรี่'
    },
    {
      type: 'ออกกำลังกาย',
      name: 'ตีกอล์ฟ (ลากถุงกอล์ฟ)',
      calory: 300,
      unit: 'กิโลแคลอรี่'
    },
    {
      type: 'ออกกำลังกาย',
      name: 'ตีกอล์ฟ (แบกถุงกอล์ฟเอง)',
      calory: 360,
      unit: 'กิโลแคลอรี่'
    },
    {
      type: 'ออกกำลังกาย',
      name: 'ตีกอล์ฟ, นั่งรถ',
      calory: 240,
      unit: 'กิโลแคลอรี่'
    },
    {
      type: 'กิจวัตร',
      name: 'ทำงาน',
      calory: 250,
      unit: 'กิโลแคลอรี่'
    },
    {
      type: 'กิจวัตร',
      name: 'ทำสวน',
      calory: 450,
      unit: 'กิโลแคลอรี่'
    },
    {
      type: 'กิจวัตร',
      name: 'นอนหลับ',
      calory: 75,
      unit: 'กิโลแคลอรี่'
    },
    {
      type: 'กิจวัตร',
      name: 'นั่งดูทีวี',
      calory: 100,
      unit: 'กิโลแคลอรี่'
    },
    {
      type: 'กิจวัตร',
      name: 'นั่งทำงานใช้สมอง',
      calory: 110,
      unit: 'กิโลแคลอรี่'
    },
    {
      type: 'ออกกำลังกาย',
      name: 'บาสเก็ตบอล',
      calory: 660,
      unit: 'กิโลแคลอรี่'
    },
    {
      type: 'กิจวัตร',
      name: 'ปูที่นอน',
      calory: 135,
      unit: 'กิโลแคลอรี่'
    },
    {
      type: 'ออกกำลังกาย',
      name: 'บาสเก็ตบอล',
      calory: 800,
      unit: 'กิโลแคลอรี่'
    },
    {
      type: 'กิจวัตร',
      name: 'ยืน',
      calory: 140,
      unit: 'กิโลแคลอรี่'
    },
    {
      type: 'กิจวัตร',
      name: 'รีดผ้า',
      calory: 150,
      unit: 'กิโลแคลอรี่'
    },
    {
      type: 'กิจวัตร',
      name: 'ลงนอน (ไม่หลับ)',
      calory: 85,
      unit: 'กิโลแคลอรี่'
    },
    {
      type: 'ออกกำลังกาย',
      name: 'วิ่งบนทางราบด้วยความเร็ว 12.8 กม./ชม.',
      calory: 825,
      unit: 'กิโลแคลอรี่'
    },
    {
      type: 'ออกกำลังกาย',
      name: 'วิ่งบนทางราบด้วยความเร็ว 18.2 กม./ชม.',
      calory: 1390,
      unit: 'กิโลแคลอรี่'
    },
    {
      type: 'ออกกำลังกาย',
      name: 'วิ่งเร็ว',
      calory: 1200,
      unit: 'กิโลแคลอรี่'
    },
    {
      type: 'ออกกำลังกาย',
      name: 'วิ่งเหยาะๆ',
      calory: 750,
      unit: 'กิโลแคลอรี่'
    },
    {
      type: 'ออกกำลังกาย',
      name: 'ว่ายน้ำ',
      calory: 750,
      unit: 'กิโลแคลอรี่'
    },
    {
      type: 'ออกกำลังกาย',
      name: 'เดินขึ้นบันได',
      calory: 1100,
      unit: 'กิโลแคลอรี่'
    },
    {
      type: 'ออกกำลังกาย',
      name: 'เดินขึ้นเนิน',
      calory: 900,
      unit: 'กิโลแคลอรี่'
    },
    {
      type: 'ออกกำลังกาย',
      name: 'เดินช้า',
      calory: 150,
      unit: 'กิโลแคลอรี่'
    },
    {
      type: 'ออกกำลังกาย',
      name: 'เดินธรรมดา',
      calory: 300,
      unit: 'กิโลแคลอรี่'
    },
    {
      type: 'ออกกำลังกาย',
      name: 'เดินลงบันได',
      calory: 425,
      unit: 'กิโลแคลอรี่'
    },
    {
      type: 'ออกกำลังกาย',
      name: 'เดินลงเนิน',
      calory: 240,
      unit: 'กิโลแคลอรี่'
    },
    {
      type: 'ออกกำลังกาย',
      name: 'เดินเร็ว',
      calory: 480,
      unit: 'กิโลแคลอรี่'
    },
    {
      type: 'กิจวัตร',
      name: 'เดินเล่น',
      calory: 210,
      unit: 'กิโลแคลอรี่'
    },
    {
      type: 'ออกกำลังกาย',
      name: 'เต้นรำ',
      calory: 350,
      unit: 'กิโลแคลอรี่'
    },
    {
      type: 'กิจวัตร',
      name: 'เย็บผ้า',
      calory: 115,
      unit: 'กิโลแคลอรี่'
    },
    {
      type: 'กิจวัตร',
      name: 'เลื่อยไม้',
      calory: 515,
      unit: 'กิโลแคลอรี่'
    },
    {
      type: 'ออกกำลังกาย',
      name: 'เล่นวอลเล่ย์บอล',
      calory: 300,
      unit: 'กิโลแคลอรี่'
    },
    {
      type: 'ออกกำลังกาย',
      name: 'เล่นสเก็ตปกติ',
      calory: 420,
      unit: 'กิโลแคลอรี่'
    },
    {
      type: 'ออกกำลังกาย',
      name: 'เล่นสเก็ตแข่งความเร็ว',
      calory: 700,
      unit: 'กิโลแคลอรี่'
    },
    {
      type: 'ออกกำลังกาย',
      name: 'เล่นฮูล่าฮูป',
      calory: 430,
      unit: 'กิโลแคลอรี่'
    },
    {
      type: 'ออกกำลังกาย',
      name: 'เล่นเทนนิสคู่',
      calory: 360,
      unit: 'กิโลแคลอรี่'
    },
    {
      type: 'ออกกำลังกาย',
      name: 'เล่นเทนนิสเดี่ยว',
      calory: 480,
      unit: 'กิโลแคลอรี่'
    },
    {
      type: 'ออกกำลังกาย',
      name: 'เล่นแบดมินตัน',
      calory: 350,
      unit: 'กิโลแคลอรี่'
    },
    {
      type: 'ออกกำลังกาย',
      name: 'เล่นโบว์ลิ่ง',
      calory: 400,
      unit: 'กิโลแคลอรี่'
    },
    {
      type: 'ออกกำลังกาย',
      name: 'แอโรบิค',
      calory: 600,
      unit: 'กิโลแคลอรี่'
    },
    {
      type: 'ออกกำลังกาย',
      name: 'เดินขึ้นเขาหรือปีนเขา',
      calory: 800,
      unit: 'กิโลแคลอรี่'
    },
    {
      type: 'ออกกำลังกาย',
      name: 'ออกกำลังกายแบบ HIT',
      calory: 800,
      unit: 'กิโลแคลอรี่'
    }
  ]);

  return {data_hour}
})
